---
kind: type
id: T:Autodesk.Revit.DB.PolyLine
zh: 多段线、折线
source: html/f3de399b-5522-f96e-2589-70bfecc557a8.htm
---
# Autodesk.Revit.DB.PolyLine

**中文**: 多段线、折线

A polyline.

## Syntax (C#)
```csharp
public class PolyLine : GeometryObject
```

## Remarks
A polyline in space is defined by a set of coordinate points.